# Import

In [4]:
import sqlite3
import pandas as pd

# Chargement des données

In [48]:
customers = pd.read_csv('data/customers.csv')
products = pd.read_csv('data/products.csv')
stores = pd.read_csv('data/stores.csv')
transactions = pd.read_csv('data/transactions.csv')

In [49]:
customers.head(5)

   customer_id customer_name  age  gender
0            1    Customer 1   25    Male
1            2    Customer 2   40  Female
2            3    Customer 3   30    Male
3            4    Customer 4   33    Male
4            5    Customer 5   43    Male

In [51]:
products.head(5)

   product_id product_name     category   price
0           1    Product 1        Books   14.02
1           2    Product 2        Books  291.83
2           3    Product 3        Books  295.06
3           4    Product 4  Electronics  228.15
4           5    Product 5    Furniture  419.20

In [52]:
stores.head(5)

   store_id store_name     location
0         1    Store 1     New York
1         2    Store 2  Los Angeles
2         3    Store 3     New York
3         4    Store 4     New York
4         5    Store 5      Phoenix

In [50]:
transactions.head(5)

   transaction_id  customer_id  product_id  store_id        date  amount
0               1           35           8        12  2023-01-01  379.09
1               2          236          34        16  2023-01-02   18.48
2               3          334          50        20  2023-01-03  783.51
3               4          325          46        20  2023-01-04  333.82
4               5          332          89         6  2023-01-05  329.74

# Connection BDD

In [ ]:
cnx = sqlite3.connect('dbase.db')

# Insertion des données

In [12]:
customers.to_sql(name='customers', con=cnx, if_exists='replace', index=False)
products.to_sql(name='products', con=cnx, if_exists='replace', index=False)
stores.to_sql(name='stores', con=cnx, if_exists='replace', index=False)
transactions.to_sql(name='transactions', con=cnx, if_exists='replace', index=False)

1000

# Exploration des Tables et Pré-Analyse

## 1 - Lister les noms des colonnes et le type de données pour chaque table.

In [28]:
query = '''
        PRAGMA table_info(transactions);
        '''

result = pd.read_sql(query, cnx)
result

   cid            name       type  notnull dflt_value  pk
0    0  transaction_id    INTEGER        0       None   0
1    1     customer_id    INTEGER        0       None   0
2    2      product_id    INTEGER        0       None   0
3    3        store_id    INTEGER        0       None   0
4    4            date  TIMESTAMP        0       None   0
5    5          amount       REAL        0       None   0

In [29]:
query = '''
        PRAGMA table_info(products);
        '''

result = pd.read_sql(query, cnx)
result

   cid          name     type  notnull dflt_value  pk
0    0    product_id  INTEGER        0       None   0
1    1  product_name     TEXT        0       None   0
2    2      category     TEXT        0       None   0
3    3         price     REAL        0       None   0

In [30]:
query = '''
        PRAGMA table_info(products);
        '''

result = pd.read_sql(query, cnx)
result

   cid        name     type  notnull dflt_value  pk
0    0    store_id  INTEGER        0       None   0
1    1  store_name     TEXT        0       None   0
2    2    location     TEXT        0       None   0

## 2 - Vérifier s'il y a des doublons dans la table transactions sur la colonne transaction_id.

In [33]:
query = """
    SELECT transaction_id, COUNT(*) as count
    FROM transactions
    GROUP BY transaction_id
    HAVING COUNT(*) > 1;
    """
result = pd.read_sql(query, cnx)
result

Empty DataFrame
Columns: [transaction_id, count]
Index: []

## 3 - Identifier les clés primaires et les clés étrangères de chaque table.

In [43]:
query = """
    PRAGMA foreign_key_list(customers);
"""
result = pd.read_sql(query, cnx)
result

query = """
    PRAGMA foreign_key_list(products);
"""
result = pd.read_sql(query, cnx)
result

query = """
    PRAGMA foreign_key_list(stores);
"""
result = pd.read_sql(query, cnx)
result

query = """
    PRAGMA foreign_key_list(transactions);
"""
result = pd.read_sql(query, cnx)
result

Empty DataFrame
Columns: [id, seq, table, from, to, on_update, on_delete, match]
Index: []

## 4 - Vérifier si la colonne date dans la table transactions est stockée dans un format date, sinon, la convertir.

In [39]:
query = """
    SELECT *, strftime('%Y', date) AS YEAR  from transactions;
    """
result = pd.read_sql(query, cnx)
result

,transaction_id,customer_id,product_id,store_id,date,amount,YEAR
0,1,35,8,12,2023-01-01 00:00:00,379.09,2023
1,2,236,34,16,2023-01-02 00:00:00,18.48,2023
2,3,334,50,20,2023-01-03 00:00:00,783.51,2023
3,4,325,46,20,2023-01-04 00:00:00,333.82,2023
4,5,332,89,6,2023-01-05 00:00:00,329.74,2023
...,...,...,...,...,...,...,...
995,996,271,62,8,2025-09-22 00:00:00,268.09,2025
996,997,380,9,4,2025-09-23 00:00:00,829.86,2025
997,998,46,22,14,2025-09-24 00:00:00,603.12,2025
998,999,2,85,8,2025-09-25 00:00:00,882.43,2025
999,1000,253,4,8,2025-09-26 00:00:00,365.28,2025

## 5 - Vérifier s'il existe des valeurs nulles dans les colonnes customer_id, product_id, store_id des transactions.

In [45]:
query = """
    SELECT 
        SUM(customer_id IS NULL) as null_customer_id,
        SUM(product_id IS NULL) as null_product_id,
        SUM(store_id IS NULL) as null_store_id
    FROM transactions;
"""
result = pd.read_sql(query, cnx)
result

   null_customer_id  null_product_id  null_store_id
0                 0                0              0

# Requêtes de Base

## 6- Lister toutes les transactions effectuées dans le magasin New York.

In [53]:
query = """
    SELECT t.*
    FROM transactions t
    JOIN stores s ON t.store_id = s.store_id
    WHERE s.location = 'New York';
"""
result = pd.read_sql(query, cnx)
result

,transaction_id,customer_id,product_id,store_id,date,amount
0,7,146,78,1,2023-01-07 00:00:00,48.99
1,12,500,81,1,2023-01-12 00:00:00,11.31
2,29,70,52,1,2023-01-29 00:00:00,290.12
3,51,400,62,1,2023-02-20 00:00:00,733.48
4,76,452,29,1,2023-03-17 00:00:00,277.07
...,...,...,...,...,...,...
396,937,104,88,20,2025-07-25 00:00:00,905.52
397,941,370,74,20,2025-07-29 00:00:00,308.36
398,960,497,2,20,2025-08-17 00:00:00,127.38
399,978,292,95,20,2025-09-04 00:00:00,218.93
400,990,399,58,20,2025-09-16 00:00:00,514.18

## 7- Récupérer les noms des produits achetés par le customer_id 35.

In [54]:
query = """
    SELECT p.product_name
    FROM transactions t
    JOIN products p ON t.product_id = p.product_id
    WHERE t.customer_id = 35;
"""
result = pd.read_sql(query, cnx)
result

  product_name
0    Product 8
1   Product 96

## 8- Lister les différents types de catégories de produits disponibles.

In [55]:
query = """
    SELECT DISTINCT category
    FROM products;
"""
result = pd.read_sql(query, cnx)
result

      category
0        Books
1  Electronics
2    Furniture
3     Clothing

## 9- Trouver le montant total des transactions pour le store_id 12.

In [56]:
query = """
    SELECT SUM(amount) as total_amount
    FROM transactions
    WHERE store_id = 12;
"""
result = pd.read_sql(query, cnx)
result

   total_amount
0      26796.29

## 10- Lister tous les clients de sexe féminin.

In [57]:
query = """
    SELECT *
    FROM customers
    WHERE gender = 'Female';
"""
result = pd.read_sql(query, cnx)
result

     customer_id customer_name  age  gender
0              2    Customer 2   40  Female
1              7    Customer 7   55  Female
2              9    Customer 9   51  Female
3             10   Customer 10   22  Female
4             11   Customer 11   69  Female
..           ...           ...  ...     ...
226          490  Customer 490   53  Female
227          494  Customer 494   35  Female
228          496  Customer 496   59  Female
229          497  Customer 497   50  Female
230          500  Customer 500   69  Female

[231 rows x 4 columns]

# Fonctions d’Agrégation et GROUP BY

## 11- Calculer la moyenne des montants des transactions par magasin.

In [58]:
query = """
    SELECT s.store_name, AVG(t.amount) as average_amount
    FROM transactions t
    JOIN stores s ON t.store_id = s.store_id
    GROUP BY s.store_name;
"""
result = pd.read_sql(query, cnx)
result

   store_name  average_amount
0     Store 1      532.130000
1    Store 10      504.817115
2    Store 11      453.278361
3    Store 12      546.863061
4    Store 13      569.012857
5    Store 14      479.562745
6    Store 15      478.972679
7    Store 16      493.564167
8    Store 17      546.908519
9    Store 18      602.175526
10   Store 19      570.356531
11    Store 2      496.529592
12   Store 20      496.091786
13    Store 3      481.485789
14    Store 4      563.986364
15    Store 5      614.618200
16    Store 6      465.471190
17    Store 7      503.759412
18    Store 8      461.190196
19    Store 9      465.133200

In [60]:
query = """
    SELECT stores.store_name, AVG(transactions.amount) as average_amount
    FROM transactions
    JOIN stores ON transactions.store_id = stores.store_id
    GROUP BY stores.store_name;
"""
result = pd.read_sql(query, cnx)
result

## 12- Trouver le magasin qui a réalisé le chiffre d'affaires le plus élevé.

In [61]:
query = """
    SELECT stores.store_name, SUM(transactions.amount) as total_sales
    FROM transactions
    JOIN stores ON transactions.store_id = stores.store_id
    GROUP BY stores.store_name
    ORDER BY total_sales DESC
    LIMIT 1;
"""
result = pd.read_sql(query, cnx)
result

  store_name  total_sales
0    Store 5     30730.91

## 13- Calculer le montant total dépensé par chaque client.

In [62]:
query = """
    SELECT customers.customer_name, SUM(transactions.amount) as total_spent
    FROM transactions
    JOIN customers ON transactions.customer_id = customers.customer_id
    GROUP BY customers.customer_name;
"""
result = pd.read_sql(query, cnx)
result

    customer_name  total_spent
0      Customer 1      2528.13
1     Customer 10      1854.36
2    Customer 101      2295.63
3    Customer 102       682.86
4    Customer 103       417.31
..            ...          ...
434   Customer 95      2541.37
435   Customer 96       565.53
436   Customer 97       403.17
437   Customer 98      1101.91
438   Customer 99      1943.84

[439 rows x 2 columns]

## 14- Trouver le produit le plus vendu en termes de quantité.

In [64]:
query = """
    SELECT products.product_name, COUNT(transactions.transaction_id) as num_sales
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id
    GROUP BY products.product_name
    ORDER BY num_sales DESC
    LIMIT 1;
"""
result = pd.read_sql(query, cnx)
result

  product_name  num_sales
0   Product 45         20

## 15- Lister les catégories de produits et le montant total des ventes par catégorie.

In [65]:
query = """
    SELECT products.category, SUM(transactions.amount) as total_sales
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id
    GROUP BY products.category;
"""
result = pd.read_sql(query, cnx)
result

      category  total_sales
0        Books    151828.24
1     Clothing    108614.35
2  Electronics    125958.34
3    Furniture    127514.47

# Clauses HAVING vs WHERE

## 16- Lister les clients qui ont effectué plus de 5 transactions.

In [66]:
query = """
    SELECT customers.customer_name, COUNT(transactions.transaction_id) as num_transactions
    FROM transactions
    JOIN customers ON transactions.customer_id = customers.customer_id
    GROUP BY customers.customer_name
    HAVING COUNT(transactions.transaction_id) > 5;
"""
result = pd.read_sql(query, cnx)
result

  customer_name  num_transactions
0  Customer 141                 6
1  Customer 277                 6
2   Customer 61                 6

## 17- Trouver les produits qui ont généré plus de 1000 en ventes totales.

In [67]:
query = """
    SELECT products.product_name, SUM(transactions.amount) as total_sales
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id
    GROUP BY products.product_name
    HAVING SUM(transactions.amount) > 1000;
"""
result = pd.read_sql(query, cnx)
result

   product_name  total_sales
0     Product 1      4334.66
1    Product 10      2154.66
2   Product 100      2560.02
3    Product 11      4129.52
4    Product 12      4236.36
..          ...          ...
95   Product 95      4382.96
96   Product 96      6980.49
97   Product 97      6947.89
98   Product 98      4940.70
99   Product 99      5780.27

[100 rows x 2 columns]

## 18- Lister les magasins ayant une moyenne de transaction supérieure à 200.

In [68]:
query = """
    SELECT stores.store_name, AVG(transactions.amount) as average_transaction
    FROM transactions
    JOIN stores ON transactions.store_id = stores.store_id
    GROUP BY stores.store_name
    HAVING AVG(transactions.amount) > 200;
"""
result = pd.read_sql(query, cnx)
result

   store_name  average_transaction
0     Store 1           532.130000
1    Store 10           504.817115
2    Store 11           453.278361
3    Store 12           546.863061
4    Store 13           569.012857
5    Store 14           479.562745
6    Store 15           478.972679
7    Store 16           493.564167
8    Store 17           546.908519
9    Store 18           602.175526
10   Store 19           570.356531
11    Store 2           496.529592
12   Store 20           496.091786
13    Store 3           481.485789
14    Store 4           563.986364
15    Store 5           614.618200
16    Store 6           465.471190
17    Store 7           503.759412
18    Store 8           461.190196
19    Store 9           465.133200

## 19- Récupérer les produits appartenant à la catégorie Books et ayant généré plus de 500 en ventes.

In [69]:
query = """
    SELECT products.product_name, SUM(transactions.amount) as total_sales
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id
    WHERE products.category = 'Books'
    GROUP BY products.product_name
    HAVING SUM(transactions.amount) > 500;
"""
result = pd.read_sql(query, cnx)
result

   product_name  total_sales
0     Product 1      4334.66
1    Product 14      7558.51
2     Product 2      5735.32
3    Product 20      5097.30
4     Product 3      5909.48
5    Product 31      3538.25
6    Product 33      6547.09
7    Product 39      7603.02
8    Product 42      7611.42
9    Product 47      2999.79
10   Product 50      4482.85
11   Product 52      5492.80
12   Product 54      7047.71
13   Product 55      4650.90
14   Product 56      1982.06
15    Product 6      3147.49
16   Product 61      7822.99
17   Product 62      6269.32
18   Product 65      3846.50
19   Product 69      4718.06
20   Product 72      5466.35
21   Product 73      3885.76
22   Product 79      8666.74
23    Product 8      4192.44
24   Product 86      4495.20
25    Product 9      7749.04
26   Product 94      6036.49
27   Product 98      4940.70

## 20- Trouver les clients ayant dépensé plus de 1000 au total.

In [70]:
query = """
    SELECT customers.customer_name, SUM(transactions.amount) as total_spent
    FROM transactions
    JOIN customers ON transactions.customer_id = customers.customer_id
    GROUP BY customers.customer_name
    HAVING SUM(transactions.amount) > 1000;
"""
result = pd.read_sql(query, cnx)
result

    customer_name  total_spent
0      Customer 1      2528.13
1     Customer 10      1854.36
2    Customer 101      2295.63
3    Customer 104      1275.28
4    Customer 105      1188.55
..            ...          ...
217    Customer 9      1039.92
218   Customer 93      1385.94
219   Customer 95      2541.37
220   Customer 98      1101.91
221   Customer 99      1943.84

[222 rows x 2 columns]

# Fonctions de Manipulation de Chaînes et Dates

## 21- Extraire l’année des dates de transactions et compter le nombre de transactions par année.

In [71]:
query = """
    SELECT STRFTIME('%Y', date) as year, COUNT(*) as num_transactions
    FROM transactions
    GROUP BY year;
"""
result = pd.read_sql(query, cnx)
result

   year  num_transactions
0  2023               365
1  2024               366
2  2025               269

## 22- Concaténer le nom du client avec son âge.

In [73]:
query = """
    SELECT customer_name || ' (' || age || ' ans)' as customer_age
    FROM customers;
"""
result = pd.read_sql(query, cnx)
result

              customer_age
0      Customer 1 (25 ans)
1      Customer 2 (40 ans)
2      Customer 3 (30 ans)
3      Customer 4 (33 ans)
4      Customer 5 (43 ans)
..                     ...
495  Customer 496 (59 ans)
496  Customer 497 (50 ans)
497  Customer 498 (51 ans)
498  Customer 499 (35 ans)
499  Customer 500 (69 ans)

[500 rows x 1 columns]

## 23- Remplacer tous les espaces par des underscores dans les noms des produits.

In [74]:
query = """
    SELECT REPLACE(product_name, ' ', '_') as product_name_with_underscores
    FROM products;
"""
result = pd.read_sql(query, cnx)
result

   product_name_with_underscores
0                      Product_1
1                      Product_2
2                      Product_3
3                      Product_4
4                      Product_5
..                           ...
95                    Product_96
96                    Product_97
97                    Product_98
98                    Product_99
99                   Product_100

[100 rows x 1 columns]

## 24- Transformer en majuscules les noms des magasins.

In [76]:
query = """
    SELECT UPPER(store_name) as store_name_maj
    FROM stores;
"""
result = pd.read_sql(query, cnx)
result

   store_name_maj
0         STORE 1
1         STORE 2
2         STORE 3
3         STORE 4
4         STORE 5
5         STORE 6
6         STORE 7
7         STORE 8
8         STORE 9
9        STORE 10
10       STORE 11
11       STORE 12
12       STORE 13
13       STORE 14
14       STORE 15
15       STORE 16
16       STORE 17
17       STORE 18
18       STORE 19
19       STORE 20

# Joins

## 25- Joindre la table transactions avec stores et afficher le nom du magasin pour chaque transaction.

In [77]:
query = """
    SELECT transactions.*, stores.store_name
    FROM transactions
    JOIN stores ON transactions.store_id = stores.store_id;
"""
result = pd.read_sql(query, cnx)
result

,transaction_id,customer_id,product_id,store_id,date,amount,store_name
0,1,35,8,12,2023-01-01 00:00:00,379.09,Store 12
1,2,236,34,16,2023-01-02 00:00:00,18.48,Store 16
2,3,334,50,20,2023-01-03 00:00:00,783.51,Store 20
3,4,325,46,20,2023-01-04 00:00:00,333.82,Store 20
4,5,332,89,6,2023-01-05 00:00:00,329.74,Store 6
...,...,...,...,...,...,...,...
995,996,271,62,8,2025-09-22 00:00:00,268.09,Store 8
996,997,380,9,4,2025-09-23 00:00:00,829.86,Store 4
997,998,46,22,14,2025-09-24 00:00:00,603.12,Store 14
998,999,2,85,8,2025-09-25 00:00:00,882.43,Store 8
999,1000,253,4,8,2025-09-26 00:00:00,365.28,Store 8

## 26- Joindre les tables transactions et products pour obtenir le nom du produit acheté dans chaque transaction.

In [78]:
query = """
    SELECT transactions.*, products.product_name
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id;
"""
result = pd.read_sql(query, cnx)
result

,transaction_id,customer_id,product_id,store_id,date,amount,product_name
0,1,35,8,12,2023-01-01 00:00:00,379.09,Product 8
1,2,236,34,16,2023-01-02 00:00:00,18.48,Product 34
2,3,334,50,20,2023-01-03 00:00:00,783.51,Product 50
3,4,325,46,20,2023-01-04 00:00:00,333.82,Product 46
4,5,332,89,6,2023-01-05 00:00:00,329.74,Product 89
...,...,...,...,...,...,...,...
995,996,271,62,8,2025-09-22 00:00:00,268.09,Product 62
996,997,380,9,4,2025-09-23 00:00:00,829.86,Product 9
997,998,46,22,14,2025-09-24 00:00:00,603.12,Product 22
998,999,2,85,8,2025-09-25 00:00:00,882.43,Product 85
999,1000,253,4,8,2025-09-26 00:00:00,365.28,Product 4

## 27- Faire une jointure entre transactions, products, et stores pour afficher le produit acheté, le magasin et le montant.

In [79]:
query = """
    SELECT transactions.transaction_id, products.product_name, stores.store_name, transactions.amount
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id
    JOIN stores ON transactions.store_id = stores.store_id;
"""
result = pd.read_sql(query, cnx)
result

     transaction_id product_name store_name  amount
0                 1    Product 8   Store 12  379.09
1                 2   Product 34   Store 16   18.48
2                 3   Product 50   Store 20  783.51
3                 4   Product 46   Store 20  333.82
4                 5   Product 89    Store 6  329.74
..              ...          ...        ...     ...
995             996   Product 62    Store 8  268.09
996             997    Product 9    Store 4  829.86
997             998   Product 22   Store 14  603.12
998             999   Product 85    Store 8  882.43
999            1000    Product 4    Store 8  365.28

[1000 rows x 4 columns]

## 28- Lister les transactions pour les clients de plus de 30 ans.

In [80]:
query = """
    SELECT transactions.*
    FROM transactions
    JOIN customers ON transactions.customer_id = customers.customer_id
    WHERE customers.age > 30;
"""
result = pd.read_sql(query, cnx)
result

,transaction_id,customer_id,product_id,store_id,date,amount
0,418,2,17,20,2024-02-22 00:00:00,556.39
1,666,2,100,3,2024-10-27 00:00:00,669.64
2,999,2,85,8,2025-09-25 00:00:00,882.43
3,446,4,93,3,2024-03-21 00:00:00,171.69
4,568,4,99,4,2024-07-21 00:00:00,847.98
...,...,...,...,...,...,...
781,345,498,60,15,2023-12-11 00:00:00,463.53
782,958,498,98,4,2025-08-15 00:00:00,283.84
783,127,499,34,10,2023-05-07 00:00:00,486.39
784,12,500,81,1,2023-01-12 00:00:00,11.31
785,604,500,5,5,2024-08-26 00:00:00,373.27

## 29- Lister tous les produits achetés par les clients de sexe masculin.

In [81]:
query = """
    SELECT products.product_name
    FROM transactions
    JOIN customers ON transactions.customer_id = customers.customer_id
    JOIN products ON transactions.product_id = products.product_id
    WHERE customers.gender = 'Male';
"""
result = pd.read_sql(query, cnx)
result

    product_name
0     Product 35
1     Product 83
2     Product 88
3     Product 89
4     Product 11
..           ...
545   Product 86
546   Product 60
547   Product 74
548   Product 98
549   Product 34

[550 rows x 1 columns]

# Sous-requêtes (Subqueries) et CTE

## 30- Trouver les clients qui ont effectué une transaction pour un montant supérieur à la moyenne des transactions.

In [82]:
query = """
    SELECT customers.customer_name
    FROM transactions
    JOIN customers ON transactions.customer_id = customers.customer_id
    WHERE transactions.amount > (SELECT AVG(amount) FROM transactions);
"""
result = pd.read_sql(query, cnx)
result

    customer_name
0    Customer 334
1    Customer 379
2     Customer 42
3     Customer 28
4    Customer 453
..            ...
497  Customer 351
498  Customer 189
499  Customer 380
500   Customer 46
501    Customer 2

[502 rows x 1 columns]

## 31- Lister les produits ayant un prix supérieur au prix moyen de leur catégorie.

In [83]:
query = """
    SELECT product_name, price, category
    FROM products
    WHERE price > (
        SELECT AVG(price) 
        FROM products as p2 
        WHERE p2.category = products.category
    );
"""
result = pd.read_sql(query, cnx)
result

   product_name   price     category
0     Product 2  291.83        Books
1     Product 3  295.06        Books
2     Product 5  419.20    Furniture
3     Product 8  388.96        Books
4     Product 9  419.09        Books
5    Product 10  332.69  Electronics
6    Product 11  267.75     Clothing
7    Product 12  450.63     Clothing
8    Product 14  309.15        Books
9    Product 15  480.60  Electronics
10   Product 17  252.33    Furniture
11   Product 18  273.78  Electronics
12   Product 19  388.56    Furniture
13   Product 20  400.85        Books
14   Product 21  229.55    Furniture
15   Product 25  498.78     Clothing
16   Product 27  404.44     Clothing
17   Product 28  488.36  Electronics
18   Product 29  430.69    Furniture
19   Product 30  369.34  Electronics
20   Product 31  488.03        Books
21   Product 32  343.67    Furniture
22   Product 34  392.02  Electronics
23   Product 35  451.66  Electronics
24   Product 40  378.11     Clothing
25   Product 42  361.28        Books
26   Product 43  296.08    Furniture
27   Product 45  332.89    Furniture
28   Product 47  265.57        Books
29   Product 50  291.19        Books
30   Product 53  400.67     Clothing
31   Product 55  325.64        Books
32   Product 57  285.73    Furniture
33   Product 60  402.04     Clothing
34   Product 61  456.27        Books
35   Product 65  280.82        Books
36   Product 66  481.85  Electronics
37   Product 68  338.24    Furniture
38   Product 71  408.40     Clothing
39   Product 72  476.81        Books
40   Product 74  404.55  Electronics
41   Product 77  264.90     Clothing
42   Product 78  270.15     Clothing
43   Product 79  496.40        Books
44   Product 82  482.74  Electronics
45   Product 83  350.40  Electronics
46   Product 93  484.12  Electronics
47   Product 95  267.34     Clothing
48   Product 98  412.89        Books
49  Product 100  352.12     Clothing

## 32- Utiliser un CTE pour calculer le montant total des transactions par client, puis filtrer pour trouver ceux ayant dépensé plus de 500.

In [84]:
query = """
    SELECT customer_name, total_spent
    FROM (
        SELECT customers.customer_name, SUM(transactions.amount) as total_spent
        FROM transactions
        JOIN customers ON transactions.customer_id = customers.customer_id
        GROUP BY customers.customer_name
    ) as subquery
    WHERE total_spent > 500;
"""
result = pd.read_sql(query, cnx)
result

    customer_name  total_spent
0      Customer 1      2528.13
1     Customer 10      1854.36
2    Customer 101      2295.63
3    Customer 102       682.86
4    Customer 104      1275.28
..            ...          ...
338   Customer 94       842.69
339   Customer 95      2541.37
340   Customer 96       565.53
341   Customer 98      1101.91
342   Customer 99      1943.84

[343 rows x 2 columns]

## 33- Lister les produits qui ont été achetés plus de 10 fois et appartenant à la catégorie Electronics.

In [85]:
query = """
    SELECT products.product_name, COUNT(transactions.transaction_id) as num_sales
    FROM transactions
    JOIN products ON transactions.product_id = products.product_id
    WHERE products.category = 'Electronics'
    GROUP BY products.product_name
    HAVING COUNT(transactions.transaction_id) > 10;
"""
result = pd.read_sql(query, cnx)
result

  product_name  num_sales
0   Product 18         11
1   Product 28         11
2   Product 34         14
3   Product 35         16
4   Product 48         16
5   Product 51         13
6   Product 58         11
7    Product 7         13
8   Product 74         17

# Fonctions Fenêtre (Window Functions)

## 34- Attribuer un rang aux transactions en fonction du montant dans chaque magasin.

In [86]:
query = """
    SELECT transaction_id, store_id, amount,
    RANK() OVER (PARTITION BY store_id ORDER BY amount DESC) as rank
    FROM transactions;
"""
result = pd.read_sql(query, cnx)
result

     transaction_id  store_id  amount  rank
0               722         1  994.80     1
1               415         1  975.16     2
2               667         1  965.60     3
3               203         1  936.11     4
4               340         1  924.09     5
..              ...       ...     ...   ...
995             452        20   95.91    52
996             584        20   69.02    53
997             598        20   49.71    54
998             715        20   42.45    55
999             630        20   24.40    56

[1000 rows x 4 columns]

## 35- Calculer la somme cumulée du montant des transactions pour chaque client.

In [87]:
query = """
    SELECT transaction_id, customer_id, amount,
    SUM(amount) OVER (PARTITION BY customer_id ORDER BY transaction_id) as cumulative_sum
    FROM transactions;
"""
result = pd.read_sql(query, cnx)
result

     transaction_id  customer_id  amount  cumulative_sum
0                32            1  377.15          377.15
1               761            1  886.60         1263.75
2               871            1  649.32         1913.07
3               965            1  615.06         2528.13
4               418            2  556.39          556.39
..              ...          ...     ...             ...
995             345          498  463.53         1389.08
996             958          498  283.84         1672.92
997             127          499  486.39          486.39
998              12          500   11.31           11.31
999             604          500  373.27          384.58

[1000 rows x 4 columns]

## 36- Attribuer un numéro de rang aux magasins basé sur le chiffre d'affaires total.

In [88]:
query = """
    SELECT store_name, total_sales,
    RANK() OVER (ORDER BY total_sales DESC) as rank
    FROM (
        SELECT stores.store_name, SUM(transactions.amount) as total_sales
        FROM transactions
        JOIN stores ON transactions.store_id = stores.store_id
        GROUP BY stores.store_name
    );
"""
result = pd.read_sql(query, cnx)
result

   store_name  total_sales  rank
0     Store 5     30730.91     1
1    Store 17     29533.06     2
2    Store 19     27947.47     3
3    Store 13     27881.63     4
4    Store 20     27781.14     5
5    Store 11     27649.98     6
6     Store 3     27444.69     7
7    Store 15     26822.47     8
8    Store 12     26796.29     9
9    Store 10     26250.49    10
10    Store 7     25691.73    11
11    Store 4     24815.40    12
12   Store 14     24457.70    13
13    Store 2     24329.95    14
14   Store 16     23691.08    15
15    Store 8     23520.70    16
16    Store 9     23256.66    17
17   Store 18     22882.67    18
18    Store 1     22881.59    19
19    Store 6     19549.79    20

## 37- Calculer le pourcentage de contribution de chaque transaction au total des ventes du magasin.

In [91]:
query = """
    SELECT transaction_id, store_id, amount,
    100.0 * amount / SUM(amount) OVER (PARTITION BY store_id) as pourcentage_contribution
    FROM transactions
    ORDER BY pourcentage_contribution DESC;
"""
result = pd.read_sql(query, cnx)
result

     transaction_id  store_id  amount  pourcentage_contribution
0               394         6  991.87                  5.073558
1               443         6  985.83                  5.042663
2               447         6  961.59                  4.918672
3               839         6  946.69                  4.842456
4               806         6  932.97                  4.772276
..              ...       ...     ...                       ...
995              43        14   17.45                  0.071348
996             868        11   18.72                  0.067703
997             471         7   17.13                  0.066675
998             810         5   15.57                  0.050666
999              12         1   11.31                  0.049428

[1000 rows x 4 columns]